Revit 2027 API
BuiltInFailures.SlabShapeFailures.SlabShapeFailedTooThin Property
 The Floor or Roof or Toposolid is too thin for its given type.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SlabShapeFailedTooThin { get; }
Public Shared ReadOnly Property SlabShapeFailedTooThin As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SlabShapeFailedTooThin {
	FailureDefinitionId^ get ();
}
static member SlabShapeFailedTooThin : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SlabShapeFailures Class
Autodesk.Revit.DB Namespace